/*-------------------------------------------------------------------------------------------------------------------
--
-- Проект      :
-- Модуль      : rate_lim
-- Автор       : Караваев К.А.
-- Компания    : МИФИ
-- Файлы       : rate_lim.cpp, rate_lim.h
--
---------------------------------------------------------------------------------------------------------------------
--
-- Описание    : Программа для линейного ограничения скорости роста сигнала
--
---------------------------------------------------------------------------------------------------------------------
--
-- V0.0 (01.01.2026)  - исходная версия
--
---------------------------------------------------------------------------------------------------------------------
*/

#include <stdio.h>

#ifndef RATE_LIM_H
#define RATE_LIM_H

//#define RISE_LIM 70     //Предельная скорость роста сигнала в об/сек
//#define FALL_LIM 70    //Предельная скорость спада сигнала в об/сек

class Rate_Limiter
{
    public:
        Rate_Limiter(int rising_lim, int falling_lim);
        int compute(int in, float dt);
        void updateConstants(int rising_lim, int falling_lim);

    private:
        int rising_lim_;
        int falling_lim_;

        int prev_out_;
        
};

#endif
