/*-------------------------------------------------------------------------------------------------------------------
--
-- Проект      : EUROBOT_2026
-- Модуль      : STM32H723
-- Автор       : Мосиевских Илья, Антонов Сергей
-- Компания    : МИФИ
-- Файлы       :
--
---------------------------------------------------------------------------------------------------------------------
--
-- Описание    : Программа для управления серводвигателями ST3215 захвата
--
---------------------------------------------------------------------------------------------------------------------
--
--V0.0.0 (27.03.2026)  - Исходная версия кода для управления сервоприводами
--V9.5.3 (01.04.2026)  - Актуализирован код для управления сервоприводами, добавлен флаг для управления только
--                       по приходе нового сообщения из servo_subscriber
--V9.6.3 (18.04.2026)  - Изменен код для управления сервоприводами
---------------------------------------------------------------------------------------------------------------------
*/

#ifndef __SERVO_TASK__
#define __SERVO_TASK__


#ifdef __cplusplus
extern "C" {
#endif

void ServoInit(void);
void ServoSpin(void);

#ifdef __cplusplus
}
#endif




#endif /*__SERVO_TASK__*/
